car_months = {
    "января": "01",
    "февраля": "02",
    "марта": "03",
    "апреля": "04",
    "мая": "05",
    "июня": "06",
    "июля": "07",
    "авгуся": "08",
    "сентября": "09",
    "октября": "10",
    "ноября": "11",
    "декабря": "12"
}

car_colors = {
    "Белый": "white",
    "Черный": "black",
    "Синий": "blue",
    "Серый": "grey",
    "Серебристый": "silver",
    "Красный": "red",
    "Зеленый": "green",
    "Апельсин": "orange",
    "Асфальт": "asphalt",
    "Бежевый": "beige",
    "Бирюзовый": "turquoise",
    "Бронзовый": "bronze",
    "Вишнёвый": "cherry",
    "Голубой": "blue",
    "Желтый": "yellow",
    "Золотой": "gold",
    "Коричневый": "brown",
    "Магнолии": "magnolias",
    "Матовый": "matte",
    "Оливковый": "olive",
    "Розовый": "pink",
    "Сафари": "safari",
    "Фиолетовый": "violet",
    "Хамелеон": "chameleon",
    "Молочный цвет": "milk",
    "Дельфин": "dolphin",
    "Мокрый асфальт": "asphalt",
    "Сахара": "sahara",
    "Перламутрово-коричневый": "purumine-brown",
    "Жёлто-зеленый": "yellow-green",
    "Сине-голубой": "blue-blue",
    "Вишня": "cherry",
    "Бронза": "bronze",
    "Бордовый": "burgundy",
    "Сиреневый": "lilac",
    "Золотистый": "gold",
    "Оранжевый": "orange"
}

car_status = {
    "Требует ремонта": "need repair",
    "Среднее": "normal",
    "Хорошее": "good",
    "Отличное": "excellent",
    "Требуетремонта": "need repair"
}

car_owner = {
    "Частное лицо": "private",
    "Бизнес": "business"
}

car_transmission = {
    "Механическая": "manual",
    "Механика": "manual",
    "Автоматическая": "automatic",
    "Автомат": "automatic",
    "Робот": "robot",
    "Типтроник": "tiptronic",
    "Вариатор": "variator"
}